# memo

In [4]:
import numpy as np
import pandas as pd

## pandas

In [9]:
df = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(5)),dtype='float32'),
                    'D' : np.array([3] * 5,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train", "test"]),
                    'F' : 'foo',
                    'G' : ['1000', np.nan, '123', '1234', '']})

In [10]:
df

     A          B    C  D      E    F     G
0  1.0 2013-01-02  1.0  3   test  foo  1000
1  1.0 2013-01-02  1.0  3  train  foo   NaN
2  1.0 2013-01-02  1.0  3   test  foo   123
3  1.0 2013-01-02  1.0  3  train  foo  1234
4  1.0 2013-01-02  1.0  3   test  foo

## NaN処理

In [11]:
# NaNであるか
df.isna()

       A      B      C      D      E      F      G
0  False  False  False  False  False  False  False
1  False  False  False  False  False  False   True
2  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False
4  False  False  False  False  False  False  False

In [12]:
# 全項目NaN化
df[df.isna()]

    A   B   C   D    E    F    G
0 NaN NaT NaN NaN  NaN  NaN  NaN
1 NaN NaT NaN NaN  NaN  NaN  NaN
2 NaN NaT NaN NaN  NaN  NaN  NaN
3 NaN NaT NaN NaN  NaN  NaN  NaN
4 NaN NaT NaN NaN  NaN  NaN  NaN

In [13]:
# blankがNaN
df[~df.isna()]

     A          B    C  D      E    F     G
0  1.0 2013-01-02  1.0  3   test  foo  1000
1  1.0 2013-01-02  1.0  3  train  foo   NaN
2  1.0 2013-01-02  1.0  3   test  foo   123
3  1.0 2013-01-02  1.0  3  train  foo  1234
4  1.0 2013-01-02  1.0  3   test  foo

## replace NaN

In [14]:
# EX) df.replace([-1, 999, 1000], np.nan)
df = df.replace('', np.nan)
df

     A          B    C  D      E    F     G
0  1.0 2013-01-02  1.0  3   test  foo  1000
1  1.0 2013-01-02  1.0  3  train  foo   NaN
2  1.0 2013-01-02  1.0  3   test  foo   123
3  1.0 2013-01-02  1.0  3  train  foo  1234
4  1.0 2013-01-02  1.0  3   test  foo   NaN

## NaNを0,000に変換

In [15]:
df[df['G'].isnull()].replace(np.nan, '0,000')

     A          B    C  D      E    F      G
1  1.0 2013-01-02  1.0  3  train  foo  0,000
4  1.0 2013-01-02  1.0  3   test  foo  0,000

- 価格区切り

In [20]:
"{:,}".format(12345678)

'12,345,678'

In [21]:
i = 12345678
f"{i:,}"

'12,345,678'

- strやから無理

In [22]:
str_ = '12345678'
f"{str_:,}"

ValueError: Cannot specify ',' with 's'.